public class Stream_06 {
    public static void main(String[] args) {

        /*******************************************************************
         * collect()와 Collectors
         *
         * collect()는 Collector 인터페이스를 매개변수로 하는 스트림의 최종연산
         * 전체 스트림에 대하여 리듀싱 할 때는 reduce()
         * 그룹별로 리듀싱 할 때는 collect()
         * 
         * Collector<T, A, R> 수집(collect)에 필요한 메서드를 정의해 놓은 인터페이스
         * T(요소)를 A에 누적한 다음, 결과를 R로 변환해서 반환
         * supplier() : 누적할 곳
         * accumulator() : 누적 방법
         *
         * Collectors는 Collector를 구현한 클래스
         * *******************************************************************/

        /*******************************************************************
         * 스트림을 컬렉션으로 변환
         * toList(), toSet(), toMap(), toCollection()
         *******************************************************************/

        /*******************************************************************
         * 스트림을 배열로 변환
         * toArray()
         *******************************************************************/

        /*******************************************************************
         * 스트림의 통계 정보 제공 (그룹별 통계)
         * counting(), summingInt(), maxBy(), minBy()
         *******************************************************************/

        /*******************************************************************
         * 스트림을 리듀싱 (그룹별 리듀싱)
         * reducing()
         *******************************************************************/

        /*******************************************************************
         * 문자열 스트림의 요소를 모두 연결
         * joining()
         *******************************************************************/



    }
}

