package Object_grammer02;

public class ch7_05_단일상속 {
    /*******************************************************************
     * 단일 상속(Single Inheritance)
     * Java는 단일 상속만을 허용한다.(C++은 다중상속 허용)
     * 비중이 높은 클래스 하나만 상속관계로, 나머지는 포함관계로 한다.
     *******************************************************************/
    /*******************************************************************
     * Object 클래스 (모든 클래스의 조상)
     * 부모가 없는 클래스는 자동적으로 Object클래스를 상속받게 된다.
     * 모든 클래스는 Object클래스에 정의된 11개의 메서드를 상속받는다.
     * toSTring(), equals(Object obj), hashCode(), ...
     *******************************************************************/
    public static void main(String[] args) {

    }
}
