package Object_grammer02;

public class ch7_23_다형성 {
    /*******************************************************************
     * 다형성 (polymorphism)
     * 조상 타입 참조 변수로 자손 타입 객체를 다루는 것
     *******************************************************************/
    /*******************************************************************
     * 객체와 참조변수의 타입이 일치할 때와 일치하지 않을 때의 차이?
     * SmartTv s = new SmartTv();            // 참조 변수와 인스턴스의 타입이 일치
     * Tv      t = new SmartTv(); (불일치 OK) // 조상 타입 참조변수로 자손 타입 인스턴스 참조
     *
     * 반대로 자손탑의 참조변수로 조상타입의 객체를 가리킬 수 없다.
     *******************************************************************/
    public static void main(String[] args) {
    }
}
