package Object_grammer06;

public class ch11_01_컬렉션프레임웍 {
    /*******************************************************************
     * collections framework
     * 컬렉션(collection)
     * - 여러 객체(데이터)를 모아 놓은 것을 의미
     * 프레임웍(framework)
     * - 표준화, 정형화된 체계적인 프로그래밍 방식
     * 컬렉션 프레임웍(collections framework)
     * - 컬렉션(다수의 객체)을 다루기 위한 표준화된 프로그래밍 방식
     * - 컬렉션을 쉽고 편리하게 다룰 수 있는 다양한 클래스를 제공
     *******************************************************************/
    /*******************************************************************
     * 컬렉션 프레임웍의 핵심 인터페이스
     * 1. List : 순서가 있는 데이터의 집합. 데이터의 중복을 허용 (ArrayList, LinkedList)
     * 2. Set  : 순서를 유지하지 않는 데이터의 집합. 데이터의 중복 X (HashSet, TreeSet)
     * 3. Map  : 키(key), 값(value)의 쌍으로 이루어진 데이터의 집합 (HashMap, TreeMap)
     *           순서는 유지되지 않으며, 키는 중복 X, 값을 중복을 허용
     *******************************************************************/
}
